app/views/twits/_twit.html.erb

            <div style="position: relative;float: right;">
              <span><%= twit.user.created_at %></span>
---
INSERT INTO "twits" ("created_at", "id", "text", "user_id") VALUES (?, ?, ?, ?)
INSERT INTO "users" ("created_at", "followers_count", "id", "name", "screen_name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)