app/views/trends/show.html.erb

SELECT COUNT(*) FROM "twits" INNER JOIN "trends_twits" ON "twits"."id" = "trends_twits"."twit_id" WHERE "trends_twits"."trend_id" = 114
---
<%
     if (@trend.twit.count() == 0)

SELECT "twits".* FROM "twits" INNER JOIN "trends_twits" ON "twits"."id" = "trends_twits"."twit_id" WHERE "trends_twits"."trend_id" = 55 ORDER BY created_at DESC LIMIT 10
---
     end
     @twits = @trend.twit.order("created_at DESC").limit(10)