app/controllers/trends_controller.rb

  def index
    @trends = Trend.all
---
SELECT "trends".* FROM "trends"