app/controllers/trends_controller.rb

SELECT "trends".* FROM "trends" WHERE "trends"."id" = ? LIMIT 1  [["id", "55"]]
SELECT "twits".* FROM "twits" WHERE "twits"."id" = 225430619688153089 LIMIT 1
---
  def refresh_twits
    Trend.find(params[:id]).refresh_twits_from_api

SELECT "trends".* FROM "trends" ORDER BY as_of DESC LIMIT 10
---
  def index

    @trends = Trend.order("as_of DESC").limit(10)

SELECT "trends".* FROM "trends" WHERE "trends"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @trend = Trend.find(params[:id])

SELECT "trends".* FROM "trends" WHERE "trends"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @trend = Trend.find(params[:id])

INSERT INTO "trends" ("as_of", "created_at", "name", "query", "updated_at") VALUES (?, ?, ?, ?, ?)  [["as_of", nil], ["created_at", Mon, 16 Jul 2012 02:47:56 UTC +00:00], ["name", nil], ["query", nil], ["updated_at", Mon, 16 Jul 2012 02:47:56 UTC +00:00]]
---
  def create
    @trend = Trend.new(params[:trend])

    respond_to do |format|
      if @trend.save

SELECT "trends".* FROM "trends" WHERE "trends"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "trends" SET "name" = 'Test', "query" = 'Jackson', "updated_at" = '2012-07-16 03:04:49.337188' WHERE "trends"."id" = 3
---
  def update
    @trend = Trend.find(params[:id])

    respond_to do |format|
      if @trend.update_attributes(params[:trend])

SELECT "trends".* FROM "trends" WHERE "trends"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "trends" WHERE "trends"."id" = ?  [["id", 1]]
---
  def destroy
    @trend = Trend.find(params[:id])
    @trend.destroy