app/controllers/twits_controller.rb

  def index
    @twits = Twit.all
---
SELECT "twits".* FROM "twits"

  def show
    @twit = Twit.find(params[:id])
---
SELECT "twits".* FROM "twits" WHERE "twits"."id" = ? LIMIT 1  [["id", "225430619688153089"]]